# Lambda Library

A Prolog library for lambda calculus expression representation and reduction, including **Î±-conversion** and **Î²-reduction**.

---

## ğŸ“¦ Usage

```prolog
?- use_module(lambda).

?- reduce([l(x,x), a], R).
R = a.

?- reduce([l(p, forall(x, implies(man(x), [p,x]))), l(x, loves(x,mary))], R).
R = forall(x, implies(man(x), loves(x, mary))).

## ğŸ› ï¸ Specification
reduce(+Exp, -Result)

Reduces a lambda calculus expression Exp to its normal form by performing Î±-conversion to avoid variable capture, and then Î²-reduction as necessary.
Argument	Description
Exp	Input expression in lambda calculus representation
Result	Fully reduced result

Deterministic: always succeeds with a single normal form (if reachable).

## ğŸ“ Data Representation

Lambda terms are represented in the following format:
Form	Meaning
l(Var, Body)	Lambda abstraction (Î»Var. Body)
[Func, Arg]	Function application ((Func Arg))
Examples
Lambda Term	Prolog Representation
Î»x.x	l(x, x)
(Î»x.x) a	[l(x, x), a]
Î»x.Î»y. x	l(x, l(y, x))
(Î»x.Î»y. x) a	[[l(x, l(y, x)), a]]
Î»p. âˆ€x (man(x) â†’ p(x))	l(p, forall(x, implies(man(x), [p, x])))

## ğŸ” Reduction Semantics

Î±-conversion renames bound variables to avoid capture during substitution.

    Example: l(x, l(x, x)) â†’ l(x1, l(x, x))

Î²-reduction applies a function to its argument.

    Example: [l(x, x), a] â†’ a

    Nested example: [[l(x, l(y, x)), a], b] â†’ a

## ğŸ§ª Examples

?- reduce([l(x, x), a], R).
R = a.

?- reduce([[l(x, l(y, x)), a], b], R).
R = a.

?- reduce([l(x, [x, z]), [l(y, y), a]], R).
R = [[l(y, y), a], z].

?- reduce([l(x, l(x, x)), a], R).
R = l(x1, x1).

## ğŸ“ Implementation Notes

Only reduce/2 is exported. Internal predicates (alpha/4, beta/4, etc.) are hidden.

Expressions are first Î±-converted (renaming of bound variables) before Î²-reduction is performed.

Recursive reductions ensure full normalization.

## âœ… Tests

test(identity)    :- reduce([l(x, x), a], a).
test(constant)    :- reduce([l(x, y), a], y).
test(nested)      :- reduce([[l(x, l(y, x)), a], b], a).
test(app_in_arg)  :- reduce([l(x, [x, z]), [l(y, y), a]], [[l(y, y), a], z]).
test(shadowing)   :- reduce([l(x, l(x, x)), a], l(x1, x1)).

